Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: In versions after PHP 4.2.0, the key will be assigned with a NULL value.
pt_br: Se variáveis declaradas na classe de qual obj é uma instância e que não tenham valores assimilados, esses não serão retornados na matriz.

source: Use of get_object_vars()
pt_br: Uso de get_object_vars()

source: Array ([x] = 1.233 [y] = 3.445 [label] =) Array ([x] = 1.233 [y] = 3.445 [label] = point #1)
pt_br: Array ([x] = 1.233 [y] = 3.445) Array ([x] = 1.233 [y] = 3.445 [label] = point #1)

source: See also get_class_methods() and get_class_vars()!
pt_br: Veja também get_class_methods() e get_class_vars()!

source: If obj is an object, returns the name of the parent class of the class of which obj is an instance.
pt_br: Se obj é um objeto, retorna o nome da classe pai da classe da qual o obj é uma instância.

source: If obj is a string, returns the name of the parent class of the class with that name.
pt_br: Se obj é uma string, retorna o nome da classe pai da classe com aquele nome.

source: This functionality was added in PHP 4.0.5.
pt_br: Esta funcionalidade foi adicionada no PHP 4.0.5.

source: See also get_class() and is_subclass_of()
pt_br: Veja também get_class() e is_subclass_of()

source: Returns the maximum value that can be returned by a call to rand().
pt_br: Retorna o valor máximo que pode ser gerado em uma chamada a função rand().

source: See also rand(), srand() and mt_getrandmax().
pt_br: Veja também rand(), srand() e mt_getrandmax().

source: This is an interface to getrusage( 2).
pt_br: Description

source: Example 1. gettext() -check
pt_br: Exemplo 1. gettext() -check

source: This is an interface to gettimeofday( 2).
pt_br: Descrição

source: It returns an associative array containing the data returned from the system call.
pt_br: Esta retorna uma matriz contendo o dado retornado da comunicação com o sistema.

source: "sec" - seconds
pt_br: "sec" - segundos

source: "usec" - microseconds
pt_br: "usec" - microsegundos

source: "minuteswest" - minutes west of Greenwich
pt_br: "minuteswest" - minutos Leste de Greenwich

source: "dsttime" - type of dst correction
pt_br: "dsttime" - tipo de correção dst

source: Returns the type of the PHP variable var.
pt_br: Description

source: Never use gettype() to test for a certain type, since the returned string may be subject to change in a future version.
pt_br: Atenção

source: The glob() function searches for all the pathnames matching pattern according to the rules used by the shell.
pt_br: Descrição

source: Returns an array containing the matched files / directories or FALSE on error.
pt_br: A função glob() procura por todos os caminhos de arquivos que batem com o padrão pattern de acordo com as regras do sistema operacional.

source: GLOB_MARK - Adds a slash to each item returned
pt_br: Nenhuma expansão ou substituição de variável é realizada.

source: GLOB_NOCHECK - Return the search pattern if no files matching it were found
pt_br: Retorna um array contendo os arquivos / diretórios localizados ou FALSE em caso de erro.

source: GLOB_NOESCAPE - Backslashes do not quote metacharacters
pt_br: Exemplo 1.

source: GLOB_BRACE - Expands {a,b,c} to match'a', 'b', or'c '
pt_br: Maneira conveniente de como glob() pode substituir opendir() e similares.

source: Convenient way how glob() can replace opendir() and friends.
pt_br: Resultado possível do exemplo acima:

source: See also opendir(), readdir() and closedir(), fnmatch().
pt_br: Veja também opendir(), readdir(), closedir(), fnmatch() e a manpage UNIX de glob(3) para os nomes das flags (uma vez que elas não estão documentadas aqui).

source: Identical to the date() function except that the time returned is Greenwich Mean Time (GMT).
pt_br: Idêntico a função date() exceto que o tempo está em Greenwich Mean Time (GMT).

source: For example, when run in Finland (GMT +0200), the first line below prints "Jan 01 1998 00:00:00", while the second prints "Dec 31 1997 22:00:00 ".
pt_br: Por exemplo, quando execulta ma Finlândia (GMT +0200), a primeira linha abaixo imprime "Jan 01 1998 00:00:00", enquando a segunda imprime "Dec 31 1997 22:00:00 ".

source: Example 1. gmdate() example
pt_br: Exemplo 1. gmdate() exemplo

source: See also date(), mktime(), gmmktime() and strftime().
pt_br: veja também date(), mktime(), gmmktime() e strftime().

source: Identical to mktime() except the passed parameters represents a GMT date.
pt_br: Idêntico ao mktime() exceto que os parâmetros passados representam uma data GMT.

source: Add two GMP numbers.
pt_br: Description

source: Divides a by b and returns the integer result.
pt_br: Description

source: Calculate greatest common divisor of a and b.
pt_br: Description

source: Computes the inverse of a modulo b.
pt_br: Description

source: Calculates n modulo d.
pt_br: Description

source: Raise base into power exp.
pt_br: Description

source: If this function returns 0, a is definitely not prime.
pt_br: Description

source: Generate a random number.
pt_br: Description

source: Behaves the same as strftime() except that the time returned is Greenwich Mean Time (GMT).
pt_br: Mesmo comportamento que strftime() exceto que o tempo retornado é Greenwich Mean Time (GMT).

source: For example, when run in Eastern Standard Time (GMT -0500), the first line below prints "Dec 31 1998 20:00:00", while the second prints "Jan 01 1999 01:00:00 ".
pt_br: Por exemplo, quando roda no Padrão de tempo Oriental (GMT -0500), a primeira linha abaixo imprime "Dec 31 1998 20:00:00", enquanto a segunda linha imprime "Jan 01 1999 01:00:00 ".

source: Example 1. gmstrftime() example
pt_br: Exemplo 1. gmstrftime() exemplo

source: See also strftime().
pt_br: Veja também strftime().

source: Valid Range for Gregorian Calendar 4714 B.C. to 9999 A.D.
pt_br: Description

source: The gz-file pointed to by zp is closed.
pt_br: Description

source: The gz-file pointer must be valid, and must point to a file successfully opened by gzopen().
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Opens a gzip (.gz) file for reading or writing.
pt_br: Description

source: Example 1. gzopen() Example
pt_br: Exemplo 1. gzopen() Example

source: header() is used to send raw HTTP headers.
pt_br: Description

source: This function is similar to hebrev() This function is similar to hebrev() with the difference that it converts newlines (\n) to "br \n".
pt_br: É similar a hebrev() a diferença é que ela converte newlines (\n) para "br \n".

source: The optional parameter max_chars_per_line indicates maximum number of characters per line will be output.
pt_br: O parâmetro opcional max_chars_per_line indica o número máximo de caracteres por linha que será exibido.

source: The function tries to avoid breaking words.
pt_br: A função evita quebrar palavras.

source: See also hebrev()
pt_br: Veja também hebrev()

source: See also hebrevc()
pt_br: Veja também hebrevc()

source: Returns the decimal equivalent of the hexadecimal number represented by the hex_string argument. hexdec() converts a hexadecimal string to a decimal number.
pt_br: Retorna o decimal equivalente do número hexadecimal representado pelo argumento hex_string. hexdec() Retorna o decimal equivalente do número hexadecimal representado pelo argumento hex_string. hexdec() converte uma string hexadecimal para um número decimal.

source: The largest number that can be converted is 7fffffff or 2147483647 in decimal.
pt_br: O maior número que pode ser convertido é 7fffffff (ou 2147483647 em decimal).

source: hexdec() will replace of any non-hexadecimal characters it encounters by 0.
pt_br: hexdec() substituirá qualquer caracter não hexadecimal que encontrar por 0.

source: This way, all left zeros are ignored, but right zeros will be valued.
pt_br: Desta forma, todos os zeros a esqueda são ignorados, mas zeros a direita serão avaliados.

source: Example 1. hexdec() example
pt_br: Exemplo 1. exemplos hexdec()

source: var_dump( hexdec("See")); var_dump(hexdec("ee")); / / both prints "int(238) "var_dump(hexdec("that")); var_dump(hexdec("a0")); / / both prints int(160)
pt_br: var_dump( hexdec("See")); var_dump(hexdec("ee")); / / ambos exibem "int(238) "var_dump(hexdec("that")); var_dump(hexdec("a0")); / / ambos exibem int(160)

source: See also dechex().
pt_br: Veja também dechex().

source: The highlight_file() function prints out a syntax higlighted version of the code contained in filename using the colors defined in the built-in syntax highlighter for PHP.
pt_br: A função highlight_file() mostra uma versão do código contido em filename com a sintaxe destacada usando as cores definidas pelo destacador de sintaxe do PHP.

source: If the second parameter return is set to TRUE then highlight_file() If the second parameter return is set to TRUE then highlight_file() will return the highlighted code as a string instead of printing it out.
pt_br: Se o segundo parâmetro return for TRUE então highlight_file() irá retornar o código como uma string ao invés de mostrá-lo.

source: If the second parameter is not set to TRUE then highlight_file() will return TRUE on success, FALSE on failure.
pt_br: Se o segundo parâmetro não for TRUE então highlight_file() irá retornar TRUE se funcionar, FALSE em caso de falha.

source: The return parameter became available in PHP 4.2.0.
pt_br: O parâmetro return tornou-se disponível no PHP 4.2.0.

source: Before this time it behaved like the default, which is FALSE
pt_br: Antes disso é usado como o padrão, que é FALSE.

source: Care should be taken when using the show_source() and highlight_file() functions to make sure that you do not inadvertently reveal sensitive information such as passwords or any other type of information that might create a potential security risk.
pt_br: Deve se tomar cuidado quando usar as funções show_source() e highlight_file() para ter certeza que você não irá inadvertidamente revelar informações sensíveis como senhas ou outros tipos de informação que possam criar um risco de segurança em potencial.

source: Since PHP 4.2.1 this function is also affected by safe_mode and open_basedir.
pt_br: Desde o PHP 4.2.1 esta função também é afetada por safe_mode e open_basedir.

source: Creating a source highlighting URL
pt_br: Criando uma URL para destaque da sintaxe

source: To setup a URL that can code hightlight any script that you pass to it, we will make use of the "ForceType" directive in Apache to generate a nice URL pattern, and use the function highlight_file() to show a nice looking code list.
pt_br: Para configurar uma url que possa fazer o destaque da sintaxe de qualquer script que você passar para ela, nós iremos fazer uso da diretiva "ForceType" no Apache para gerar um bom modelo de URL, e usar a função highlight_file() para mostrar o código com uma boa aparência.

source: In your httpd.conf you can add the following:
pt_br: No seu httpd.conf você pode adicionar o seguinte:

source: And then make a file named "source" and put it in your web root directory.
pt_br: E então faça um arquivo chamado "source" e coloque-o no seu diretório raiz do servidor web.

source: HTML HEAD TITLE Source Display / TITLE / HEAD BODY BGCOLOR=" white "?php $script = getenv ("PATH_TRANSLATED"); if(!$script) {echo" BR B ERROR:
pt_br: HTML HEAD TITLE Mostrar Fonte / TITLE / HEAD BODY BGCOLOR=" white "?php $script = getenv ("PATH_TRANSLATED"); if(!$script) {echo" BR B ERRO:

source: Script Name needed / B BR ";} else {if (ereg("(\.php_BAR_\.inc)$",$script)) {echo" H1 Source of: $PATH_INFO / H1 \n HR \n"; highlight_file($script);} else {echo "H1 ERROR:
pt_br: Necessário o nome do script / B BR ";} else {if (ereg("(\.php_BAR_\.inc)$",$script)) {echo" H1 Source of: $PATH_INFO / H1 \n HR \n"; highlight_file($script);} else {echo "H1 ERRO:

source: Only PHP or include script names are allowed / H1 ";}} echo" HR Processed: ".date("Y / M/d H:i:s",time());? / BODY / HTML
pt_br: Somente PHP ou script de inclusão( .inc) são permitidos / H1 ";}} echo" HR Processado: ".date("Y / M/d H:i:s",time());? / BODY / HTML

source: Then you can use an URL like the one below to display a colorized version of a script located in "/ path / to / script.php" in your web site.
pt_br: Então você pode usar uma URL como a abaixo para mostrar uma versão colorida do script localizado em "/ caminho / para / script.php" no seu site web.

source: http: / /your.server.com / source / path / to / script.php
pt_br: http: / /your.server.com / source / caminnho / para / script.php

source: See also highlight_string(), show_source().
pt_br: Veja também highlight_string(), show_source().

source: The highlight_string() function outputs a syntax highlighted version of str using the colors defined in the built-in syntax highlighter for PHP.
pt_br: A função highlight_string() mostra o destaque da sintaxe para o parâmetro str usando as cores definidas para o destacador de sintaxe do PHP.

source: If the second parameter return is set to TRUE then highlight_string() If the second parameter return is set to TRUE then highlight_string() will return the highlighted code as a string instead of printing it out.
pt_br: Se o segundo parâmetro return for TRUE então a função highlight_string() irá retornar o código com a sintaxe destacada ao invés de mostrá-lo.

source: If the second parameter is not set to TRUE then highlight_string() will return TRUE on success, FALSE on failure.
pt_br: Se o segundo parâmetro não for TRUE então highlight_string() irá retornar TRUE se funcionar, FALSE se ocorrer falha.

source: See also highlight_file(), and show_source().
pt_br: Veja também highlight_file(), e show_source().

source: This function is identical to htmlspecialchars() in all ways, except with htmlentities(), all characters which have HTML character entity equivalents are translated into these entities.
pt_br: Descrição

source: Like htmlspecialchars(), the optional second quote_style parameter lets you define what will be done with'single 'and "double "quotes.
pt_br: Como htmlspecialchars(), ele leva um segundo argumento opcional que indica o que seria feito com aspas simples e dupla.

source: It takes on one of three constants with the default being ENT_COMPAT:
pt_br: ENT_QUOTES será convertido ambas aspas simples e dupla, e ENT_NOQUOTES deixará ambas desconvertidas.

source: Table 1.
pt_br: No presente momento, o conjunto de caracteres ISO-8859-1 é usado como padrão.

source: Available quote_style constants
pt_br: Suporte para o segundo argumento opcional foi adicionado no PHP 3.0.17 e PHP 4.0.3.

source: Will convert double-quotes and leave single-quotes alone.
pt_br: Como htmlspecialchars() ,ele leva um terceiro argumento opcional que define o conjunto de caracteres usados na conversão.

source: Support for the optional quote parameter was added in PHP 4.0.3.
pt_br: Suporte para esse argumento foi adicionado no PHP 4.1.0.

source: Like htmlspecialchars(), it takes an optional third argument which defines character set used in conversion.
pt_br: Não há o oposto desta função.

source: Support for this argument was added in PHP 4.1.0.
pt_br: Entretanto, você pode criar uma você próprio.

source: Presently, the ISO-8859-1 character set is used as the default.
pt_br: Aqui está um exemplo de como fazer isso.

source: If you' re wanting to decode instead (the reverse) you can use html_entity_decode().
pt_br: Oposto de htmlentities()

source: See also html_entity_decode(), get_html_translation_table(), htmlspecialchars(), nl2br(), and urlencode().
pt_br: Veja também htmlspecialchars() e nl2br().

source: html_entity_decode() is the opposite of htmlentities() in that it converts all HTML entities to their applicable characters from string.
pt_br: html_entity_decode() é o oposto da função htmlentities() no que converte todas as entidades HTML para os seus caracteres de string.

source: The optional second quote_style parameter lets you define what will be done with 'single' and "double "quotes.
pt_br: O segundo parâmetro, que é opcional, quote_style permite você definir o que será feito com 'apostrofos' e "aspas ".

source: Constant Name
pt_br: Nome da Constante

source: Will convert both double and single quotes.
pt_br: Irá converter ambos.

source: Will leave both double and single quotes unconverted.
pt_br: Irá deixar ambos sem converter.

source: The ISO-8859-1 character set is used as default for the optional third charset.
pt_br: O conjunto de caracteres ISO-8859-1 é usado como padrão para o terceiro parâmetro, que é opcional, charset.

source: This defines the character set used in conversion.
pt_br: Este defini o conjunto de caracteres usado na conversão.

source: Decoding html entities
pt_br: Decodificando entidades html

source: See also htmlentities(), htmlspecialchars(), get_html_translation_table(), htmlspecialchars() and urldecode().
pt_br: Veja também htmlentities(), htmlspecialchars(), get_html_translation_table(), htmlspecialchars() e urldecode().

source: Certain characters have special significance in HTML, and should be represented by HTML entities if they are to preserve their meanings.
pt_br: Certos caracteres tem significado especial em HTML, e seriam representados pela realidade HTML se eles estão preservanado seus significados.

source: This function returns a string with some of these conversions made; the translations made are those most useful for everyday web programming.
pt_br: Esta função retorna uma string com algumas destas conversões feitas; As transformações feitas são aquelas mais úteis para programação web.

source: If you require all HTML character entities to be translated, use htmlentities() instead.
pt_br: Se você precisa que sejam transformados todos os caracteres da realidade HTML, use htmlentities() no lugar dela.

source: This function is useful in preventing user-supplied text from containing HTML markup, such as in a message board or guest book application.
pt_br: Esta função é útil na prevenção de textos fornecidos pelo usuário contendo marcação HTML, tal como um quadro de mensgens ou guest book.

source: The optional second argument, quote_style, tells the function what to do with single and double quote characters.
pt_br: O segundo argumento opcional, quote_style, conta à função o que fazer com os caracteres aspas simples e dupla.

source: The default mode, ENT_COMPAT, is the backwards compatible mode which only translates the double-quote character and leaves the single-quote untranslated.
pt_br: O modo padrão, ENT_COMPAT, é o modo mais compatível com a atualidade, apenas transforma a aspas-dupla e deixa a aspas-simples como está.

source: If ENT_QUOTES is set, both single and double quotes are translated and if ENT_NOQUOTES is set neither single nor double quotes are translated.
pt_br: Se ENT_QUOTES está definida, ambas transformadas e se ENT_NOQUOTES está definida nenhuma das duas são modificadas.

source: The translations performed are:
pt_br: As traduções executadas são:

source: '' (ampersand) becomes' amp; '
pt_br: '' (ampersand) torna-se 'amp;'

source: '"' (double quote) becomes' quot; 'when ENT_NOQUOTES is not set.
pt_br: '"' (aspas dupla) torna-se 'quot;' quando ENT_NOQUOTES não está definida.

source: '' '(single quote) becomes' #039; 'only when ENT_QUOTES is set.
pt_br: '' '(aspas simples) torna-se' #039; 'apenas quando ENT_QUOTES está definida.

source: '' (less than) becomes' lt; '
pt_br: '' (menor que) torna-se 'lt;'

source: '' (greater than) becomes' gt; '
pt_br: '' (maior que) torna-se 'gt;'

source: Example 1. htmlspecialchars() example
pt_br: Exemplo 1. htmlspecialchars() exemplo

source: Note that this function does not translate anything beyond what is listed above.
pt_br: Note que esta função não converte nada além do que foi listado acima.

source: For full entity translation, see htmlentities().
pt_br: Para completa realidade de conversões, veja htmlentities().

source: Support for the optional second argument was added in PHP 3.0.17 and PHP 4.0.3.
pt_br: Suporte para o segundo argumento opcional foi adicionado no PHP 3.0.17 e PHP 4.0.3.

source: The third argument defines character set used in conversion.
pt_br: O terceiro argumento define o conjunto de caracteres usados na conversão.

source: The default character set is ISO-8859-1.
pt_br: O conjunto de caracteres padrão é ISO-8859-1.

source: Support for this third argument was added in PHP 4.1.0.
pt_br: Suporte para o terceiro argumento foi adicionado no PHP 4.1.0.

source: See also get_html_translation_table(), htmlentities() and nl2br().
pt_br: Veja também htmlentities() e nl2br().

source: Returns the value of the attribute.
pt_br: Description

source: This function checks in an object or a whole hiearchie of objects.
pt_br: Description

source: This function checks out an object or a whole hiearchie of objects.
pt_br: Description

source: Retrieves all destination anchors of an object.
pt_br: Description

source: Retrieves the destination object pointed by the specified source anchors.
pt_br: Description

source: This function is a shortcut for hwapi_insert().
pt_br: Description

source: This function retrieves an object the specified anchor belongs to.
pt_br: Description

source: Commits a version of a docuemnt.
pt_br: Description

source: Retrieves all source anchors of an object.
pt_br: Description

source: Converts an object_array into an object record.
pt_br: Description

source: Returns an array of object ids.
pt_br: Description

source: Returns an array of object records.
pt_br: Description

source: Returns the object record of the document.
pt_br: Description

source: Returns the BODY tag of the document.
pt_br: Description

source: Returns the content of the document.
pt_br: Description

source: Sets or replaces the content of the document.
pt_br: Description

source: Returns the size in bytes of the document.
pt_br: Description

source: Uploads the text document to the server.
pt_br: Description

source: Returns the object record for the object with ID objectID.
pt_br: Description

source: Returns an indexed array of object ids.
pt_br: Description

source: Returns the children of a remote document.
pt_br: Description

source: Returns a remote document.
pt_br: Description

source: Returns the document with object ID objectID.
pt_br: Description

source: Identifies as user with username and password.
pt_br: Description

source: Uploads a document into the collection with parent_id.
pt_br: Description

source: Inserts an object into the server.
pt_br: Description

source: Example 1. modifying an attribute
pt_br: Exemplo 1. modifying an attribute

source: Example 2. adding a completely new attribute
pt_br: Exemplo 2. adding a completely new attribute

source: Example 3. modifying Title attribute
pt_br: Exemplo 3. modifying Title attribute

source: Example 4. modifying Title attribute
pt_br: Exemplo 4. modifying Title attribute

source: Example 5. removing attribute
pt_br: Exemplo 5. removing attribute

source: Converts an object_record into an object array.
pt_br: Description

source: Prints the document without the BODY tag.
pt_br: Description

source: Returns the Hyperwave document with object ID objectID.
pt_br: Description

source: Up
pt_br: Acima

source: This function is EXPERIMENTAL.
pt_br: Atenção

source: The behaviour of this function, the name of this function, and anything else documented about this function may change without notice in a future release of PHP.
pt_br: Isso quer dizer que o comportamento desta função e seu nome, incluindo TUDO o que está documentado aqui pode mudar em futuras versões do PHP, SEM QUALQUER NOTIFICAÇÃO.

source: Use this function at your own risk.
pt_br: Esteja avisado, e use esta função por sua própria conta e risco.

source: This function is currently not documented; only the argument list is available.
pt_br: Esta função não está documentada, somente a lista de argumentos está disponível.
